# Intro to pandas Indexing and Selecting

Let's work through pandas [indexing and selecting](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html) data to get and set subsets of pandas objects.

In [165]:
import numpy as np
import pandas as pd

%matplotlib inline

### pandas has three ways to index:
    
  **.loc** (mainly label based, but can be used with a boolean array) inputs include:
-    A single label, e.g. 5 or 'a' (Note that 5 is interpreted as a label of the index. This use is not an integer position along the index.)
-    A list or array of labels ['a', 'b', 'c']
-    A slice object with labels 'a':'f' (Note that contrary to usual python slices, both the start and the stop are included, when present in the index! See Slicing with labels.)
-    A boolean array
-    A callable, see [Selection By Callable](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-callable)

  
  **.iloc** (mainly integer position based, but can be used with a boolean array) inputs include:
  
-    An integer e.g. 5
-    A list or array of integers [4, 3, 0]
-    A slice object with ints 1:7
-    A boolean array
-    A callable, see [Selection By Callable](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-callable)

  
  **[ ]** (the most basic indexing uses square brackets)

In [166]:
# Example similar to what the documentation uses, to create a simple time series data set:
dates = pd.date_range('1/1/2000', periods=10)
df = pd.DataFrame(np.random.randn(10,5), index=dates, columns=['A', 'B', 'C', 'D', 'E'])
df

                   A         B         C         D         E
2000-01-01 -1.304028  1.127377 -0.426133  1.881919 -0.738301
2000-01-02 -0.834625 -0.569104  1.301898 -1.325719 -1.329499
2000-01-03 -0.374138  0.326205 -0.703970  1.807141 -1.036084
2000-01-04  0.819997 -0.329745 -0.867889  0.861661  0.809619
2000-01-05 -0.330284 -0.689091  1.828434 -1.374577 -0.021425
2000-01-06 -0.219075  0.259015 -0.616535  2.134153 -1.614332
2000-01-07  0.290995  1.229536 -0.150599  1.369849  1.051726
2000-01-08 -2.210393  0.284083  0.977097 -0.887960  0.746785
2000-01-09 -0.842907 -0.585655  0.302929 -0.567062 -0.219453
2000-01-10 -0.354592  0.557610  1.559985 -1.825729  1.001017

In [167]:
# Basic indexing using square brackets
s = df['A'] # Get a Series by indexing into the 'A' column
s[dates[5]] # Index into the Series s using a row label (which in this case is from dates), and an integer position (which in this example is the number 5)

-0.2190747619760561

In [168]:
# Pass a list of columns to select columns in that order
df1 = df[['B', 'D']]
df1

                   B         D
2000-01-01  1.127377  1.881919
2000-01-02 -0.569104 -1.325719
2000-01-03  0.326205  1.807141
2000-01-04 -0.329745  0.861661
2000-01-05 -0.689091 -1.374577
2000-01-06  0.259015  2.134153
2000-01-07  1.229536  1.369849
2000-01-08  0.284083 -0.887960
2000-01-09 -0.585655 -0.567062
2000-01-10  0.557610 -1.825729

In [169]:
# To swap columns, use the raw values, e.g.:
df.loc[:, ['B', 'D']] = df[['D', 'B']].to_numpy()
df[['D', 'B']]

                   D         B
2000-01-01  1.127377  1.881919
2000-01-02 -0.569104 -1.325719
2000-01-03  0.326205  1.807141
2000-01-04 -0.329745  0.861661
2000-01-05 -0.689091 -1.374577
2000-01-06  0.259015  2.134153
2000-01-07  1.229536  1.369849
2000-01-08  0.284083 -0.887960
2000-01-09 -0.585655 -0.567062
2000-01-10  0.557610 -1.825729

In [170]:
# Its possible to access an index on a Series or a column on a DataFrame using an attribute, e.g.:
df.B

2000-01-01    1.881919
2000-01-02   -1.325719
2000-01-03    1.807141
2000-01-04    0.861661
2000-01-05   -1.374577
2000-01-06    2.134153
2000-01-07    1.369849
2000-01-08   -0.887960
2000-01-09   -0.567062
2000-01-10   -1.825729
Freq: D, Name: B, dtype: float64

In [171]:
sa = df[['B']]
sa.B[:5] # Index into a Series sa, the first 5 values
# sa. Use the tab completion to see available attributes that can be used

2000-01-01    1.881919
2000-01-02   -1.325719
2000-01-03    1.807141
2000-01-04    0.861661
2000-01-05   -1.374577
Freq: D, Name: B, dtype: float64

In [172]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x.iloc[2] = {'x': 9, 'y': 99} # Set new row/column values using .iloc
x

   x   y
0  1   3
1  2   4
2  9  99

In [173]:
# With Series, the syntax for slicing works exactly as with an ndarray, 
# This returns a slice of the values and the corresponding labels:
s[:5]
s[::2]
s[::-1]

2000-01-10   -0.354592
2000-01-09   -0.842907
2000-01-08   -2.210393
2000-01-07    0.290995
2000-01-06   -0.219075
2000-01-05   -0.330284
2000-01-04    0.819997
2000-01-03   -0.374138
2000-01-02   -0.834625
2000-01-01   -1.304028
Freq: -1D, Name: A, dtype: float64

In [174]:
# Setting can also be done:
s2 = s.copy()
s2[:5] = 2
s2

2000-01-01    2.000000
2000-01-02    2.000000
2000-01-03    2.000000
2000-01-04    2.000000
2000-01-05    2.000000
2000-01-06   -0.219075
2000-01-07    0.290995
2000-01-08   -2.210393
2000-01-09   -0.842907
2000-01-10   -0.354592
Freq: D, Name: A, dtype: float64

#### With DataFrame, slicing inside of square brackets [] slices the rows.

In [175]:
df[:3]
df[::-1]

                   A         B         C         D         E
2000-01-10 -0.354592 -1.825729  1.559985  0.557610  1.001017
2000-01-09 -0.842907 -0.567062  0.302929 -0.585655 -0.219453
2000-01-08 -2.210393 -0.887960  0.977097  0.284083  0.746785
2000-01-07  0.290995  1.369849 -0.150599  1.229536  1.051726
2000-01-06 -0.219075  2.134153 -0.616535  0.259015 -1.614332
2000-01-05 -0.330284 -1.374577  1.828434 -0.689091 -0.021425
2000-01-04  0.819997  0.861661 -0.867889 -0.329745  0.809619
2000-01-03 -0.374138  1.807141 -0.703970  0.326205 -1.036084
2000-01-02 -0.834625 -1.325719  1.301898 -0.569104 -1.329499
2000-01-01 -1.304028  1.881919 -0.426133  1.127377 -0.738301

Every label asked for must be in the index. When slicing, both the start bound AND the stop bound are included, if they are present in the index.

### Integer based indexing
.iloc

In [176]:
df1 = pd.DataFrame(np.random.randn(5,2), columns=['A', 'B'])
df1
df1.iloc[:, 0:2]
df1.iloc[0:2]

          A         B
0 -0.841546 -0.138746
1  0.388673 -0.065345

In [177]:
# Using a callable
df1 = pd.DataFrame(np.random.randn(6, 4),
                    index=list('abcdef'),
                    columns=list('ABCD'))
df1
df1.loc[:, lambda df: ['A', 'B']]
df1.loc[lambda df: df.A > 0]
df1.iloc[:, lambda df: [0,1]]
df1[lambda df: df.columns[0]]

a   -0.304869
b    0.380424
c   -0.284115
d    0.332465
e    0.925067
f    0.351215
Name: A, dtype: float64

Note that while the `def` keyword is used to define normal functions, the `lambda` keyword is used to create anonymous functions. It has the following syntax:
    
    lambda arguments: expression

This function can have any number of arguments but only one expression, which is evaluated and returned.
One is free to use lambda functions wherever function objects are required.

In [178]:
# Using callable indexing in Series
df1.A.loc[lambda s: s>0]

b    0.380424
d    0.332465
e    0.925067
f    0.351215
Name: A, dtype: float64

If one needs to select elements that might be missing, use `.reindex()`

Using a boolean vector to index a Series is similar to how a NumPy ndarray works. The operators are: | for or, & for and, and ~ for not. These must be grouped by using parentheses.

In [179]:
s = pd.Series(range(-3,4))
s
s[s > 0]
s[(s < -1) | (s > 0.5)]
s[~(s < 0)]

3    0
4    1
5    2
6    3
dtype: int64

In [180]:
# Using list comprehensions and `map` method of Series
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                    'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
                    'c': np.random.randn(7)})
df2
# Only want 'two' or 'three'
criterion = df2['a'].map(lambda x: x.startswith('t'))
df2[criterion]

# multiple criteria:
df2[criterion & (df2['b'] == 'x')]

       a  b         c
3  three  x -1.518168

To select rows where one or more column have specific values use the `isin()` method of Series. DataFrame also has this method.

In [181]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')
s
s.isin([2,4,6])
s[s.isin([2,4,6])]

# This can be done for `index` objects as well:
s[s.index.isin([2, 4, 6])]

4    0
2    2
dtype: int64

In [182]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
                    'ids2': ['a', 'n', 'c', 'n']})

values = ['a', 'b', 1, 3]

df.isin(values)
df[df.isin(values)]

   vals  ids ids2
0   1.0    a    a
1   NaN    b  NaN
2   3.0  NaN  NaN
3   NaN  NaN  NaN

Combine DataFrame’s `isin` with the `any()` and `all()` methods to  select subsets of your data that meet a given criteria. To select a row where each column meets its own criterion:

In [183]:
values = {'ids': ['a', 'b'], 'ids2': ['a', 'c'], 'vals': [1, 3]}
values['ids']
row_mask = df.isin(values).any(1)
df[row_mask]
#df[df.isin(values).all(1)]

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c

The where method can be used in Series and DataFrame.

In [184]:
s[s>0] # Get only the selected rows
s.where(s>0) # Returns a Series of the same shape as the original Series

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [197]:
# Note that `where` is used from a DataFrame with boolean criterion under the hood, e.g.:
df = pd.DataFrame(np.random.randn(5,5), index=[0,1,2,3,4], columns=['A', 'B', 'C', 'D', 'E'])
df[df < 0]

# `where` can take a callable argument
# where takes an optional other argument to replace values where the condition is false:
df.where(df < 0, -df)

# Values can also be set based on some boolean criteria, for Series and DataFrae, but here is a Series example:
s2 = s.copy()
s2[s2 < 0] = 0
s2

# Use `inplace` if you need the original data modified and not just copied
df_orig = df.copy()
df_orig.where(df > 0, -df, inplace=True)
df_orig

          A         B         C         D         E
0  0.212482  0.471301  1.355932  0.851417  0.190886
1  0.467644  0.558244  0.691607  0.996552  0.762383
2  0.268040  0.280466  2.053472  0.708753  0.865685
3  2.510604  1.754125  1.292967  0.689366  1.115227
4  1.379084  0.834741  1.399158  0.284171  0.571376

Note that `mask()` is the inverse boolean operation of `where`

DataFrame objects have a `query()` method that allows selection using an expression

### Set/Reset index

If one needs to add an index after you’ve already created a DataFrame, there are a couple of different ways to do this:

-    create a new, re-indexed DataFrame:
    - Use the `set_index()` method 
-    transfer the index values into the DataFrame’s columns and set a simple integer index (this is the opposite of set_index() ):
    - Use the `reset_index()` method